tutorials/StagDrop/FTStagDropLa12000/0.org/mu
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      mu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0.008165;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.008165;
    }
    walls
    {
        type            fixedValue;
        value           uniform 0.008165;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0.008165;
    }
}


// ************************************************************************* //
